# Missing Data

In [13]:
import numpy as np
import pandas as pd

In [16]:
df = pd.DataFrame({'A':[1,2,np.nan],
                   'B':[3,np.nan,np.nan],
                   'C':[4,5,6]})

df

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [17]:
# we can drop rows that contain null values
df.dropna()

     A    B  C
0  1.0  3.0  4

In [18]:
# we can also drop columns with null vlues
df.dropna(axis=1)

   C
0  4
1  5
2  6

In [20]:
# we can also add a threshold for the number of null values
df.dropna(thresh=2)

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5

In [21]:
# we can also add some new value to the null values
df.fillna('new value')

           A          B  C
0        1.0        3.0  4
1        2.0  new value  5
2  new value  new value  6

In [22]:
# apart from any random value, we can fill any relevant value
# such as we can fill null value with the mean of that column

df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

<hr>